Repository: 84000/data-translation-memory
Catalog: toh154-v2.tmx
Source language: bo
Languages: en

source: དབང་པོ་མ་ཚང་བ་མེད་པས་ལུས་དང་། ངག་དང་། སེམས་ལ་དབང་བ་འཐོབ་པ་དང་།
en: Because they do not have impaired faculties they will obtain strength of body, speech, and mind.

source: དགྲ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བས་ལོངས་སྤྱོད་དང་དབང་ཕྱུག་ལ་དབང་བ་རྒྱ་ཆེན་པོ་འཐོབ་པ་དང་།
en: Because they are unassailable by all enemies they will obtain vast dominion over resources and power.

source: བསོད་ནམས་ཀྱི་དབང་གིས་དེའི་སེམས་ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱོད་པ་རྒྱ་ཆེན་པོ་ཐམས་ཅད་ལ་འགྲོ་བ་དང་།
en: Due to the power of their merit, they will experience all the vast pleasures and enjoyments.

source: དགབ་པ་མཆོག་འཐོབ་པས་རྒྱལ་པོ་དང་དབང་པོས་མཆོད་པ་དང་།
en: Because they obtain the supreme joy they will be honored by kings and lords. And

source: སྔོན་ཕྲག་དོག་མེད་པས་ལོངས་སྤྱོད་ཇི་ལྟར་སྨོན་པ་རྣམས་དེ་ལས་སྟོང་ཕྲག་བརྒྱ་འགྱུར་དུ་ཁྱད་པར་དུ་འགྱུར་བ་འཐོབ་པ་སྟེ།
en: because they lack any prior jealousy, the wealth they obtain will be a hundred thousand times greater than what they wished for.

source: ཀླུའི་བདག་པོ་བརྣབ་སེམས་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་དབང་པོ་ལྔ་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken covetousness will obtain those five strengths.

source: བརྣབ་སེམས་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking covetousness toward unexcelled and perfect awakening,

source: དེ་དགེ་བའི་རྩ་བ་དེས་འཇིག་རྟེན་གསུམ་གྱིས་མཆོད་པའི་དེ་བཞིན་གཤེགས་པ་སྟོན་པ་གཅིག་པུར་འགྱུར་རོ། །
en: then, because of those roots of virtue, they will become the sole teachers, thus-gone ones who are revered by the three worlds.

source: ཀླུའི་བདག་པོ་གནོད་སེམས་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡིད་བདེ་བར་བྱེད་པའི་ཆོས་བརྒྱད་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken malevolence will obtain eight qualities that bring peace of mind.

source: དེའི་སེམས་རྣམ་པར་མི་འཚེ་བ་ལ་འགྲོ་བར་འགྱུར་བ་དང་།
en: They will be inclined toward nonviolence.

source: དེའི་སེམས་གནོད་སེམས་རབ་ཏུ་ཞི་བ་ལ་འགྲོ་བར་འགྱུར་བ་དང་།
en: They will be inclined toward pacifying malevolence.

source: དེའི་སེམས་རྩོད་པ་མེད་ཅིང་འཐབ་པ་མེད་པ་ལ་འགྲོ་བར་འགྱུར་བ་དང་།
en: They will be inclined toward eliminating conflicts and quarrels.

source: དེའི་སེམས་དྲང་ཞིང་མཉེན་ལ་དེས་པ་ལ་འགྲོ་བར་འགྱུར་བ་དང་།
en: They will be inclined toward being honest, kind, and gentle.

source: འཕགས་པའི་སྐྱེ་བོར་གྲགས་པར་འགྱུར་བ་དང་།
en: They will be renowned as noble beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བར་དགའ་ཞིང་བྱམས་པའི་སེམས་ཕན་པའི་དངོས་པོ་མང་བར་འགྱུར་བ་དང་།
en: They will have greater ability to benefit all beings through such means as delighting in others’ happiness and having loving kindness.

source: བདེ་བ་ལ་མངོན་པར་དགའ་ཞིང་དད་པ་མང་ལ་སྐྱེ་བོ་མང་པོས་བསྟི་སྟང་བྱ་བར་འགྱུར་བ་དང་།
en: They will be honored by many beings since they delight in others’ happiness and have much faith. And

source: སེམས་སྣུམ་ཞིང་ལས་སུ་རུང་བས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་འཐོབ་པ་མི་དཀོན་པར་འགྱུར་བ་སྟེ།
en: because they are kind and capable, it will not be difficult to attain rebirth in the abode of Brahmā.

source: ཀླུའི་བདག་པོ་གནོད་སེམས་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡིད་བདེ་བར་བྱེད་པའི་ཆོས་བརྒྱད་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken malevolence will obtain those eight qualities that bring peace of mind.

source: གནོད་སེམས་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking malevolence toward unexcelled and perfect awakening,

source: དེ་དགེ་བའི་རྩ་བ་དེས་སེམས་ཐོགས་པ་མེད་པའི་དེ་བཞིན་གཤེགས་པ་བལྟ་བས་མི་ངོམས་པར་འགྱུར་རོ། །
en: then, because of those roots of virtue, they will become thus-gone ones with unobstructed minds whom one never tires of seeing.

source: ཀླུའི་བདག་པོ་ལོག་པར་ལྟ་བ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡོན་ཏན་གྱི་ཆོས་བཅུ་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken wrong views will obtain ten excellent qualities.

source: བསམ་པ་དགེ་བར་འགྱུར་ཞིང་གྲོགས་པོ་དགེ་བ་རྙེད་པར་འགྱུར་བ་ཡིན།
en: Their thoughts will become virtuous and they find virtuous friends;

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པས་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱེད་པ་ཡིན།
en: because of trusting that actions bear fruit they do not commit evil deeds even at the cost of their lives.

source: ལྷར་སངས་རྒྱས་འཛིན་གྱི་གཞན་ལྷར་མི་འཛིན་པ་ཡིན།
en: They consider the Buddha to be their deity and they do not consider anyone else to be their deity.

source: ངོ་མཚར་དང་བཀྲ་ཤིས་དང་བྲལ་བས་ལྟ་བ་དྲང་བ་ཡིན།
en: They have a sincere view because they do not believe in wonders and luck.

source: གྲོགས་ལྷ་དང་མི་ཡིན་གྱི་དུད་འགྲོའི་སྐྱེ་གནས་པ་དང་གཤིན་རྗེའི་འཇིག་རྟེན་པ་གྲོགས་སུ་མི་འགྱུར་བ་ཡིན།
en: They associate with gods and humans, but they do not associate with animals and those who live in the realm of the Lord of Death.

source: བསོད་ནམས་སྦྱངས་པས་ཁྱད་པར་དུ་འགྲོ་བ་ཡིན།
en: They obtain distinction by practicing virtue.

source: ལོག་པ་ཐམས་ཅད་མེད་པས་འཕགས་པའི་ལམ་དུ་ཞུགས་པ་ཡིན།
en: They have entered the path of the noble ones because they do not follow false paths.

source: འཇིག་ཚོགས་ལ་ལྟ་བ་དང་བྲལ་ཞིང་སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ་ཡིན།
en: They are free from the belief in the transitory collection and they have abandoned all evil deeds.

source: ཡང་དག་པར་སོང་ཞིང་ཡང་དག་པར་ཞུགས་པས་སྒྲིབ་པ་མེད་པར་མཐོང་བ་ཡིན།
en: They have unobscured insight because they have journeyed toward perfection and entered perfection;

source: ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་མི་ཁོམ་པ་དང་བྲལ་བ་ཡིན་ཏེ།
en: and they are free from unfavorable states among gods and humans.

source: ཀླུའི་བདག་པོ་ལོག་པར་ལྟ་བ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡོན་ཏན་གྱི་ཆོས་བཅུ་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken wrong views will obtain those ten excellent qualities.

source: ལོག་པར་ལྟ་བ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking wrong views toward unexcelled and perfect awakening,

source: དགེ་བའི་རྩ་བ་དེས་དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་དུ་འགྱུར་ཏེ།
en: then, because of those roots of virtue, they will manifest all the qualities of a buddha.

source: མངོན་པར་ཤེས་པ་མྱུར་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: They will become thus-gone ones with swift supernatural knowledge.

source: ཀླུའི་བདག་པོ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ནི་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཕུན་སུམ་ཚོགས་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་གྱི་རྩ་བ་དང་རྟེན་ཏོ།
en: “Lord of nāgas, these paths of the ten virtues are the roots and foundations for all the mundane and the supramundane excellence up to and including unexcelled and perfect awakening.

source: བཟློག་ན་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཏེ།
en: Their opposites are the paths of the ten nonvirtues.

source: དེ་དག་ཤས་ཆེར་བསྟེན་ཅིང་བསྒོམས་ཏེ་མང་དུ་བྱས་ན་སེམས་ཅན་དམྱལ་བའི་རྒྱུའོ། །
en: If one has predominantly resorted to, cultivated, and engaged in them to a great extent, that is cause for birth in the hell realms.

source: འབྲིང་ནི་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་རྒྱུའོ། །
en: If one has engaged in them to a middling extent, that is cause for birth in the realm of animals.

source: ཆུང་ངུ་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་རྒྱུའོ། །
en: If one has engaged in them to a lesser extent, then that is cause for birth in the realm of the Lord of Death.

source: ཀླུའི་བདག་པོ་དེ་ལ་སྲོག་གཅོད་པ་བསྟེན་ཅིང་བསྒོམས་ཏེ་མང་དུ་བྱས་ན་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Furthermore, lord of nāgas, those who have practiced, cultivated, and engaged in killing to a great extent will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: དེ་ནས་གལ་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ན་ཡང་རྣམ་པར་སྨིན་པ་གཉིས་མངོན་པར་སྒྲུབ་སྟེ།
en: Even if they are subsequently born in the human realm, they will experience two consequences:

source: ཚེ་ཐུང་བ་དང་། ནད་མང་བར་འགྱུར་བའོ། །
en: their lives will be shortened, and they will be sickly.

source: མ་བྱིན་པར་ལེན་པས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who steal will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: ལོངས་སྤྱོད་ཆུང་བ་དང་། ཐུན་མོང་གི་ལོངས་སྤྱོད་དུ་འགྱུར་བའོ། །
en: they will have few resources and their resources will be ordinary.

source: འདོད་པ་ལ་ལོག་པར་གཡེམ་པས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who engage in sexual misconduct will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: གཡོག་འཁོར་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། འགྲན་ཟླ་དང་བཅས་པའི་ཆུང་མར་འགྱུར་བའོ། །
en: their followers will not be trustworthy, and their wives will be adversarial.

source: བརྫུན་དུ་སྨྲ་བས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who engage in lying will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: སྐུར་པ་མང་བ་དང་། གཞན་གྱིས་སླུ་བར་འགྱུར་བའོ། །
en: they will be greatly criticized, and they will be deceived by others.

source: ཕྲ་མས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who engage in slander will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: གཡོག་འཁོར་མི་འདུམ་པ་དང་། གཡོག་འཁོར་ངན་པར་འགྱུར་བའོ། །
en: their attendants will be fractious and have bad characters.

source: ཚིག་རྩུབ་པོས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who use harsh words will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: ཡིད་དུ་མི་འོང་བ་ཐོས་པ་དང་། ཐབ་མོའི་ཚིག་ཏུ་འགྱུར་བའོ། །
en: they will hear unpleasant speech and aggressive speech.

source: ཚིག་ཀྱལ་པས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who engage in meaningless talk will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: གཟུང་བར་འོས་པའི་ཚིག་མ་ཡིན་པ་དང་། མ་ངེས་པའི་སྤོབས་པར་འགྱུར་བའོ། །
en: their words will not be valued, and their eloquence will be unreliable.

source: བརྣབ་སེམས་ཀྱིས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who engage in covetousness will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: ཆོག་མི་ཤེས་པ་དང་། འདོད་པ་ཆེ་བར་འགྱུར་བའོ། །
en: they will be insatiable, and their desires will increase.

source: གནོད་སེམས་ཀྱིས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who engage in malevolence will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: མི་ཕན་པ་འདོད་པ་དང་། གཞན་གྱིས་གནོད་པ་བྱ་བར་འགྱུར་བའོ། །
en: they will crave what is unhelpful and others will do them harm.

source: ལོག་པར་ལྟ་བས་ནི་སེམས་ཅན་དམྱལ་བར་ཁྲིད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཁྲིད་དོ། །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཁྲིད་དོ། །
en: “Those who hold wrong views will be led to the hell realms, to the animal realm, or to the realm of the Lord of Death.

source: ལྟ་བ་ངན་པར་ལྟུང་བ་དང་། གཡོ་སྒྱུ་ཅན་དུ་འགྱུར་བའོ། །
en: they will lapse into degenerate views and they will be deceitful.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་མི་དགེ་བ་བཅུ་པོ་འདི་དག་གིས་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་ཚད་མེད་པ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་རོ། །
en: Therefore, lord of nāgas, these ten nonvirtues will truly give rise to an immeasurably great mass of suffering.

source: ཀླུའི་བདག་པོ་དེ་ལ་སྲོག་གཅོད་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken killing engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་ཚེ་རིང་བར་འགྱུར་རོ། །
en: It will not be stolen, and they will have long lives.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་གཞན་གྱིས་གནོད་པ་བྱ་བའི་འཇིགས་པ་ལས་ཡང་དག་པར་འདས་པར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will be free from any fear of being harmed by others.

source: ཀླུའི་བདག་པོ་མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken stealing engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་དངོས་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བར་ཡོངས་སུ་གཏོང་བ་ཅན་དུ་འགྱུར་རོ། །
en: It will not be stolen, and they will become freely generous without consideration for any of their possessions.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པས་བླ་ན་མེད་པའི་ཆོས་རྙེད་པར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will accomplish all the aspects of a buddha and so gain unexcelled qualities.

source: ཀླུའི་བདག་པོ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken sexual misconduct engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་ཆུང་མ་མི་གཡེམ་པར་འགྱུར་རོ། །
en: It will not be stolen, and their wives will not be adulterous.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་མ་དང་། བུ་དང་། ཆུང་མ་ལ་སུ་ཡང་སྡང་བའི་སེམས་ཀྱིས་ལྟ་བར་མི་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will not view any mother, child, or wife with hostility.

source: ཀླུའི་བདག་པོ་བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken lying engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། སྐུར་པ་འདེབས་པ་མེད་པར་འགྱུར་བ་ནི་ནན་ཏན་སྲུང་བར་འགྱུར་རོ། །
en: It will not be stolen, and they will not be slandered but earnestly defended.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་དེ་ཡི་དམ་ལ་བརྟན་པར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will act as they say, and they will keep their word.

source: ཀླུའི་བདག་པོ་ཕྲ་མའི་ཚིག་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken slander engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་གཡོག་འཁོར་མི་ཕྱེད་པར་འགྱུར་རོ། །
en: It will not be stolen, and their followers will not be divided.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་བསམ་པ་འཐུན་པས་བྱང་ཆུབ་སེམས་དཔའི་གཡོག་འཁོར་འཐོབ་བོ། །
en: And when they engage in bodhisattva activity, they will gain retinues of bodhisattvas because their harmonious attitude.

source: ཀླུའི་བདག་པོ་ཚིག་རྩུབ་པོ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken harsh words engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། གཟུང་བའི་ཚིག་ཏུ་འགྱུར། བཙུན་པའི་ཚིག་ཏུ་འགྱུར་རོ། །
en: It will not be stolen, and their words will be heeded and respected.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་འཁོར་མ་མགུ་བར་སུ་ཡང་མི་འགྲོའོ། །
en: And when they engage in bodhisattva activity, no one in their retinues will be discontent.

source: ཀླུའི་བདག་པོ་ཚིག་ཀྱལ་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken meaningless talk engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། མཉན་པར་འོས་པའི་ཚིག་ཏུ་འགྱུར། ཡིད་ཆེས་པའི་ཚིག་ཏུ་འགྱུར་རོ། །
en: It will not be stolen, and their words will become worth hearing and trustworthy.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་ལ་མཁས་པར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will be skilled at cutting through all doubts.

source: ཀླུའི་བདག་པོ་བརྣབ་སེམས་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken covetousness engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱོད་པ་རྒྱ་ཆེན་པོ་ལ་དེའི་སེམས་འགྲོ་བར་འགྱུར་རོ། །
en: It will not be stolen, and their minds will be inclined toward great pleasures and enjoyments.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་རྒྱ་ཆེན་པོ་ལ་མོས་ཤིང་དབང་ཆེ་བར་གྲགས་པར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will aspire to the vast and they will be renowned as mighty.

source: ཀླུའི་བདག་པོ་གནོད་སེམས་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken malevolence engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། མཛེས་པ་དང་སྐྱེ་བོ་མང་པོ་དགའ་ཞིང་ཡིད་དུ་འོང་བར་འགྱུར་རོ། །
en: It will not be stolen. They will be beautiful, and they will delight and please many beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་ཐོགས་པ་མེད་པའི་བློ་དང་། ཐོགས་པ་མེད་པའི་སེམས་དང་། དབང་པོ་མ་ཚང་བ་མེད་པར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will have unobstructed intellect, unobstructed minds, and unimpaired faculties.

source: ཀླུའི་བདག་པོ་ལོག་པར་ལྟ་བ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: “Lord of nāgas, if bodhisattvas who have forsaken wrong views engage in generosity, then their wealth will increase.

source: ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། སངས་རྒྱས་ལ་དད་ཅིང་ཡང་དག་པར་ལྟ་བའི་ཁྱིམ་དུ་སྐྱེའོ། །
en: It will not be stolen. They will have faith in the Buddha and be born into households with correct views.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་སངས་རྒྱས་ལ་ལྟ་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པ་དང་མི་འབྲལ་བར་འགྱུར་རོ། །
en: And when they engage in bodhisattva activity, they will always behold the Buddha, listen to the Dharma, and serve the Saṅgha, while never failing to generate the mind set on awakening.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་སྦྱིན་པས་བརྒྱན་ན་འབྱོར་པ་ཆེན་པོར་འགྱུར་རོ། །
en: “Lord of nāgas, if these paths of the ten virtues are adorned with generosity in that way, one will reap great fortune.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཉིད་ཚུལ་ཁྲིམས་ཀྱིས་བརྒྱན་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་དོན་དུ་སྨོན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: If these paths of the ten virtues are adorned with discipline, then aspirations for all buddha qualities will be fulfilled.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཉིད་བཟོད་པས་བརྒྱན་ན་མཚན་དང་། དཔེ་བྱད་བཟང་པོ་དང་། སངས་རྒྱས་ཀྱི་དབྱངས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: If these paths of the ten virtues are adorned with patience, then the excellent major and minor marks, and the voice of a buddha, will be perfected.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་བརྩོན་འགྲུས་ཀྱིས་བརྒྱན་ན་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རྫོགས་པར་འགྱུར་རོ། །
en: Likewise, if they are adorned with diligence, then māras and opponents will be overcome and all buddha qualities will be perfected.

source: བསམ་གཏན་གྱིས་བརྒྱན་ན་དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། དགའ་བ་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །
en: If they are adorned with concentration, then mindfulness, intelligence, understanding, modesty, and joy will be purified.

source: ཤེས་རབ་ཀྱིས་བརྒྱན་ན་ལྟ་བ་ངན་པ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་འགྱུར་རོ། །
en: If they are adorned with insight, then all degenerate views will be vanquished.

source: བྱམས་པས་བརྒྱན་ན་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་སུ་འགྱུར་རོ། །
en: If they are adorned with love, then there will be no anger toward any being.

source: སྙིང་རྗེས་བརྒྱན་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་འགྱུར་རོ། །
en: If they are adorned with compassion, then no beings will be abandoned.

source: དགའ་བས་བརྒྱན་ན་ཞུམ་པ་མེད་པའི་སེམས་སུ་འགྱུར་རོ། །
en: If they are adorned with joy, then one will not be discouraged.

source: བཏང་སྙོམས་ཀྱིས་བརྒྱན་ན་རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤོང་བར་འགྱུར་རོ། །
en: If they are adorned with equanimity, then attachment and anger will be abandoned.

source: བསྡུ་བའི་དངོས་པོས་བརྒྱན་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །
en: If they are adorned with the means of attraction, then they will ripen all beings.

source: དྲན་པ་ཉེ་བར་གཞག་པས་བརྒྱན་ན་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་མཁས་པར་འགྱུར་རོ། །
en: If they are adorned with the applications of mindfulness, then one will become expert in the body, feelings, mind, and phenomena.

source: ཡང་དག་པར་སྤོང་བས་བརྒྱན་ན་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: If they are adorned with the correct relinquishments, then all nonvirtuous qualities will be abandoned and all virtuous qualities will be perfected.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པས་བརྒྱན་ན་ལུས་དང་། སེམས་ཡང་བར་འགྱུར་རོ། །
en: If they are adorned with the four bases of miraculous power, then body and mind will be light.

source: དབང་པོ་ལྔས་བརྒྱན་ན་དད་པ་བརྟན་པ་དང་། བརྩོན་འགྲུས་འབར་བ་དང་། རྨོངས་པ་མེད་པ་དང་། སེམས་ལས་སུ་རུང་བ་ལ་མཁས་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བ་ལ་མཁས་པར་འགྱུར་རོ། །
en: If they are adorned with the five faculties, then one’s faith will be stable, diligence will blaze, there will be no delusion, one will be skilled at training the mind, and one will be skilled at eliminating all disturbing emotions.

source: སྟོབས་ཀྱིས་བརྒྱན་ན་རྫི་བ་མེད་ཅིང་དབུལ་བ་དང་ཉེས་པ་ཐམས་ཅད་འཇོམས་པར་འགྱུར་རོ། །
en: If they are endowed with the powers, then one will not be oppressed and will overcome all poverty and misfortune.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་གིས་བརྒྱན་ན་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: If they are adorned with the limbs of awakening, then all phenomena will be comprehended exactly as they are.

source: ལམ་གྱིས་བརྒྱན་ན་ཡང་དག་པའི་ཡེ་ཤེས་འགྲུབ་པར་འགྱུར་རོ། །
en: If they are adorned with the path, then true wisdom will be obtained.

source: ཞི་གནས་ཀྱིས་བརྒྱན་ན་ཉོན་མོངས་པ་ཐམས་ཅད་འཇོམས་པར་འགྱུར་རོ། །
en: If they are adorned with tranquility, then all disturbing emotions will be vanquished.

source: ལྷག་མཐོང་གིས་བརྒྱན་ན་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པའི་ཤེས་རབ་དང་ཡེ་ཤེས་སུ་འགྱུར་རོ། །
en: If they are adorned with insight, then there will be the insight and wisdom of comprehending all phenomena exactly as they are.

source: ཐབས་ཀྱིས་བརྒྱན་ན་འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་བདེ་བ་འཐོབ་པར་འགྱུར་རོ། །
en: If they are adorned with skillful means, then one will attain compounded and uncompounded happiness.

source: ཀླུའི་བདག་པོ་མདོར་ན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་གིས་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: “Lord of nāgas, in short, by means of these paths of the ten virtues, the ten powers will be perfected.

source: མི་འཇིགས་པ་བཞི་འཐོབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་འཐོབ་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་བར་དག་འཐོབ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Everything from the attainment of the four types of fearlessness and the eighteen unique qualities of a buddha up to the attainment of all the qualities of a buddha will be perfected.

source: ཀླུའི་བདག་པོ་དེ་བས་ན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་རྒྱ་ཆེར་རྣམ་པར་དབྱེ་བས་བརྒྱན་པའི་ཕྱིར་བརྩོན་པར་གྱིས་ཤིག །
en: Therefore, lord of nāgas, you must strive to adorn the paths of the ten virtues with these numerous distinctions.

source: ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ།
en: “Lord of nāgas, comsider the following analogy:

source: དཔེར་ན་ས་ལ་གནས་པའི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་དང་།
en: The earth is the foundation for all things established on the ground, such as all villages, towns, cities, districts, regions, and kingdoms.

source: རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་དང་། ལས་ཀྱི་མཐའ་ཐམས་ཅད་དང་། ས་བོན་གྱི་ཚོགས་ཐམས་ཅད་དང་། འབྱུང་བའི་ཚོགས་ཐམས་ཅད་དང་།
en: It is the basis for all grass, shrubs, herbs, forests, and farmland, and all seeds, sprouts, and harvests.

source: ལོ་ཏོག་ཐམས་ཅད་སྐྱེད་པ་དང་། རྨོ་བ་བརྐོ་བ་བྱ་བ་འབྱུང་བ་དེ་དག་གི་གནས་ནི་ས་ཡིན་ནོ། །
en: It is where all sowing, ploughing, and cultivation take place.
